Revit 2027 API
AssemblyDifferenceMemberDifference Class
 The two assemblies being compared have different members
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceMemberDifference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyDifferenceMemberDifference : AssemblyDifference
Public Class AssemblyDifferenceMemberDifference
	Inherits AssemblyDifference
public ref class AssemblyDifferenceMemberDifference : public AssemblyDifference
type AssemblyDifferenceMemberDifference =
    class
        inherit AssemblyDifference
    end
The AssemblyDifferenceMemberDifference type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AssemblyDifference)
MemberDifference |  Difference between the assembly members
MemberId1 |  Id of the member in the first assembly
MemberId2 |  Id of the member in the second assembly
Top
Methods
Name | Description
Dispose
(Inherited from AssemblyDifference)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This difference means that there is a member of the first assembly which is different from the corresponding member of the second assembly. Details about the difference are in memberDifference.
See Also
Reference
Autodesk.Revit.DB Namespace